Revit 2026 API

# ViewSheetSetViews Property

---

The views.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual ViewSet Views { get; set; }
```
```vb
Public Overridable Property Views As ViewSet
	Get
	Set
```
```cpp
public:
virtual property ViewSet^ Views {
	ViewSet^ get ();
	void set (ViewSet^ value);
}
```
```fsharp
abstract Views : ViewSet with get, set
override Views : ViewSet with get, set
```

#### Property Value

ViewSet

#### Implements

IViewSheetSetViews

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input views is . |
| InvalidOperationException | Thrown when the set operation failed due to invalid view which cannot be printed. |

#### Reference

ViewSheetSet Class

Autodesk.Revit.DB Namespace